---
kind: other
id: Methods.T:Autodesk.Revit.DB.Analysis.EnergyDataSettings
source: html/28e3492c-2355-8335-2923-ea5421015d51.htm
---
# EnergyDataSettings Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.